using tyuiu.cources.programming.interfaces.Sprint2;
namespace Tyuiu.MalcevDV.Sprint2.Task2.V19.Lib
{
    public class DataService : ISprint2Task2V19
    {
        public bool CheckDotInShadedArea(int x, int y)
        {
            int[,] bitmap = new int[15, 15]
    {
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0},
        {0,0,1,1,1,0,0,0,1,1,1,1,0,0,0},
        {0,0,1,1,1,0,0,0,1,1,0,0,0,0,0},
        {0,0,1,1,1,1,1,1,1,1,0,0,0,0,0},
        {0,0,1,1,1,1,1,1,1,1,1,1,1,0,0},
        {0,0,1,1,1,1,1,1,1,1,1,1,1,0,0},
        {0,0,0,0,0,1,0,0,0,0,1,1,1,0,0},
        {0,0,0,0,0,1,0,0,0,0,1,1,0,0,0},
        {0,0,0,0,0,1,0,0,0,0,1,1,0,0,0},
        {0,0,1,1,1,1,0,0,1,1,1,1,0,0,0},
        {0,0,0,0,0,0,0,0,1,1,1,0,0,0,0},
        {0,0,0,0,0,0,1,1,1,1,1,0,0,0,0},
        {0,0,0,0,0,0,0,0,1,1,1,1,1,0,0},
        {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0}
    };

            // Проверяем границы и возвращаем значение из массива
            if (x >= 1 && x <= 15 && y >= 1 && y <= 15)
            {
                return bitmap[y - 1, x - 1] == 1;
            }

            return false; // Если координаты вне диапазона
        }
    }
    }
